# 1、可变不可变类型

# 可变类型: 值改变，id不变，证明改变的是原值，证明原值可以被改变

# 不可变类型： 值改变，id也改变，证明是产生新的值，压根没改变原值，证明原值不可以被修改

# 2、验证
# 2.1
# x = 10
# print(id(x))
# x = 11
# print(id(x))

# int是不可变类型，所有赋值都是产生新值，底层从新划分内存存值


# 2.2
# x = 1.1
# print(id(x))
# x = 2.2
# print(id(x))

# float是不可变类型，所有赋值都是产生新值，底层从新划分内存存值


# 2.3
# x = "asdasd"
# print(id(x))
# x = "zxcvf"
# print(id(x))

# string是不可变类型，所有赋值都是产生新值，底层从新划分内存存值
# 小结：在python中 int，float，str都被设计成了不可分割的整体，不能够被改变

# 2.4
# x = [1, 2, 4, 3]
# print(id(x))
# x[0] = 2
# print(id(x))
# 列表是可变类型


# 2.5
dic = {2: 2, "k2": "cccc"}
print(id(dic))
dic["k1"] = "33333"
dic[2] = "33333"
print(dic)
print(id(dic))
# 字典是可变类型

# 2.6 布尔类型不可变


# 关于字典补充：
# 定义： {}内用逗号分隔开多个key:value，其中value可以是任意额类型，但是key必须是不可变类型
